Autodesk.Revit.UI.IExternalApplication.OnShutdown(Autodesk.Revit.UI.UIControlledApplication)
Implement this method to execute some tasks when Autodesk Revit shuts down.
application: A handle to the application being shut down.
Returns: Indicates if the external application completes its work successfully.

Autodesk.Revit.UI.IExternalApplication.OnStartup(Autodesk.Revit.UI.UIControlledApplication)
Implement this method to execute some tasks when Autodesk Revit starts.
application: A handle to the application being started.
Returns: Indicates if the external application completes its work successfully.

Autodesk.Revit.UI.IExternalApplication
An interface that supports addition of external applications to Revit.
Remarks: External applications are permitted to customize the Revit UI, and to add events
and updaters to the session.